set_property SRC_FILE_INFO {cfile:/home/yutong/RISC-V_SoC/src/pynq-z2_v1.0.xdc rfile:../../../../../src/pynq-z2_v1.0.xdc id:1} [current_design]
set_property SRC_FILE_INFO {cfile:/home/yutong/RISC-V_SoC/src/soc.sdc rfile:../../../../../src/soc.sdc id:2} [current_design]
set_property src_info {type:XDC file:1 line:63 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN Y18 IOSTANDARD SSTL18_I} [get_ports riscv_rmii_tx_en]
set_property src_info {type:XDC file:1 line:64 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN Y19 IOSTANDARD SSTL18_I} [get_ports {riscv_rmii_rxd[0]}]
set_property src_info {type:XDC file:1 line:66 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN U18 IOSTANDARD SSTL18_I} [get_ports riscv_rmii_refclk]
set_property src_info {type:XDC file:1 line:67 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN Y17 IOSTANDARD SSTL18_I} [get_ports {riscv_rmii_txd[1]}]
set_property src_info {type:XDC file:1 line:69 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN Y16 IOSTANDARD SSTL18_I} [get_ports {riscv_rmii_txd[0]}]
set_property src_info {type:XDC file:1 line:70 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN U19 IOSTANDARD SSTL18_I} [get_ports {riscv_rmii_rxd[1]}]
set_property src_info {type:XDC file:1 line:71 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN W18 IOSTANDARD SSTL18_I} [get_ports riscv_rmii_crs_dv]
set_property src_info {type:XDC file:1 line:84 export:INPUT save:INPUT read:READ} [current_design]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets riscv_jtag_tck_IBUF_BUFG]
set_property src_info {type:XDC file:1 line:85 export:INPUT save:INPUT read:READ} [current_design]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets riscv_jtag_tck_IBUF]
set_property src_info {type:XDC file:1 line:86 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN W14 IOSTANDARD SSTL18_I} [get_ports riscv_jtag_tck]
set_property src_info {type:XDC file:1 line:87 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN Y14 IOSTANDARD SSTL18_I} [get_ports riscv_jtag_tms]
set_property src_info {type:XDC file:1 line:88 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN T11 IOSTANDARD SSTL18_I} [get_ports riscv_jtag_tdi]
set_property src_info {type:XDC file:1 line:89 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN T10 IOSTANDARD SSTL18_I} [get_ports riscv_jtag_tdo]
set_property src_info {type:XDC file:1 line:184 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name sclk -source [get_pins {soc_i/processing_system7_0/inst/PS7_i/FCLKCLK[0]}] -divide_by 2 -add -master_clock clk_fpga_0 [get_ports *sclk_0*]
set_property src_info {type:XDC file:1 line:185 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN V6 IOSTANDARD LVCMOS33} [get_ports sclk_0]
set_property src_info {type:XDC file:1 line:186 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN Y6 IOSTANDARD LVCMOS33} [get_ports nss_0]
set_property src_info {type:XDC file:1 line:188 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN U7 IOSTANDARD LVCMOS33} [get_ports miso_0]
set_property src_info {type:XDC file:1 line:190 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN C20 IOSTANDARD LVCMOS33} [get_ports mosi_0]
set_property src_info {type:XDC file:1 line:196 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN W6 IOSTANDARD LVCMOS33} [get_ports riscv_uart_rxd]
set_property src_info {type:XDC file:1 line:197 export:INPUT save:INPUT read:READ} [current_design]
set_property -dict {PACKAGE_PIN Y7 IOSTANDARD LVCMOS33} [get_ports riscv_uart_txd]
set_property src_info {type:XDC file:2 line:6 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks sclk] 12.000 [get_ports miso_0]
set_property src_info {type:XDC file:2 line:7 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks sclk] 10.000 [get_ports {mosi_0 nss_0 sclk_0}]
set_property src_info {type:XDC file:2 line:10 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks clk_fpga_0] 10.000 [get_ports riscv_uart_rxd]
set_property src_info {type:XDC file:2 line:11 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks clk_fpga_0] 10.000 [get_ports riscv_uart_txd]
set_property src_info {type:XDC file:2 line:16 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[0]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:17 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[1]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:18 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[2]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:19 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[3]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:20 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[4]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:21 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[5]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:22 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[6]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:23 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[7]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:24 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[8]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:25 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[9]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:26 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[10]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:27 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[11]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:28 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[12]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:29 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[13]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:30 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[14]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:31 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[15]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:32 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[16]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:33 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[17]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:34 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[18]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:35 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[19]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:36 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[20]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:37 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[21]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:38 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[22]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:39 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[23]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:40 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[24]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:41 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[25]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:42 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[26]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:43 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[27]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:44 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[28]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:45 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[29]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:46 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[30]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:47 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[31]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:49 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[0]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:50 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[1]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:51 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[2]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:52 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[3]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:53 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[4]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:54 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[5]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:55 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[6]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:56 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[7]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:57 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[8]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:58 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[9]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:59 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[10]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:60 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[11]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:61 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[12]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:62 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[13]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:63 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[14]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:64 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[15]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:65 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[16]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:66 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[17]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:67 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[18]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:68 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[19]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:69 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[20]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:70 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[21]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:71 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[22]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:72 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[23]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:73 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[24]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:74 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[25]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:75 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[26]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:76 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[27]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:77 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[28]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:78 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[29]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:79 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[30]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:80 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[31]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:81 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_slverr_reg/D] -100.000 -clock [get_clocks clk_fpga_0]
set_property src_info {type:XDC file:2 line:83 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:84 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[3]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:85 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[4]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:86 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[5]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:87 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[6]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:88 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[7]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:89 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[8]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:90 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[9]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:91 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[10]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:92 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[11]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:93 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_write_reg/D] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:94 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[0]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:95 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[1]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:96 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:97 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[3]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:98 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[4]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:99 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[5]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:100 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[6]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:101 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[7]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:102 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[8]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:103 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[9]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:104 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[10]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:105 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[11]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:106 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[12]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:107 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[13]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:108 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[14]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:109 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[15]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:110 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[16]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:111 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[17]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:112 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[18]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:113 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[19]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:114 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[20]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:115 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[21]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:116 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[22]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:117 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[23]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:118 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[24]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:119 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[25]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:120 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[26]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:121 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[27]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:122 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[28]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:123 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[29]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:124 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[30]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:125 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[31]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:127 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[0]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:128 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[1]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:129 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:130 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[3]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:131 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[4]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:132 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[5]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:133 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[6]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:134 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[7]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:135 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[8]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:136 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[9]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:137 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[10]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:138 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[11]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:139 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[12]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:140 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[13]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:141 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[14]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:142 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[15]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:143 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[16]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:144 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[17]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:145 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[18]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:146 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[19]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:147 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[20]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:148 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[21]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:149 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[22]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:150 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[23]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:151 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[24]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:152 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[25]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:153 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[26]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:154 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[27]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:155 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[28]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:156 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[29]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:157 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[30]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:158 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[31]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:159 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_write_reg/D] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:160 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[0]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:161 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[1]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:162 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:163 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[3]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:164 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[4]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:165 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[5]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:166 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[6]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:167 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[7]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:168 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[8]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:169 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[9]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:170 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[10]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:171 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[11]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:172 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[12]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:173 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[13]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:174 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[14]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:175 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[15]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:176 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[16]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:177 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[17]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:178 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[18]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:179 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[19]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:180 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[20]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:181 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[21]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:182 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[22]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:183 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[23]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:184 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[24]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:185 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[25]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:186 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[26]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:187 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[27]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:188 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[28]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:189 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[29]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:190 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[30]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:191 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[31]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:192 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_size_reg[0]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:193 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_size_reg[1]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:194 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_size_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:195 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_prot_reg[0]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:196 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_prot_reg[1]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:197 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_prot_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_property src_info {type:XDC file:2 line:198 export:INPUT save:INPUT read:READ} [current_design]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_secen_reg/D] -22.000 -clock [get_clocks riscv_jtag_tck]
