create_clock -period 100.000 -name riscv_jtag_tck -waveform {0.000 50.000} [get_ports -filter { NAME =~  "*riscv_jtag_tck*" && DIRECTION == "IN" }]
create_clock -period 20.000 -name riscv_rmii_refclk -waveform {0.000 10.000} [get_ports -filter { NAME =~  "*riscv_rmii_refclk*" && DIRECTION == "IN" }]
create_generated_clock -name sclk -source [get_pins {soc_i/processing_system7_0/inst/PS7_i/FCLKCLK[0]}] -divide_by 2 -add -master_clock clk_fpga_0 [get_ports *sclk_0*]

set_clock_groups -asynchronous -group [get_clocks {clk_fpga_0 sclk}] -group [get_clocks clk_fpga_1] -group [get_clocks riscv_jtag_tck] -group [get_clocks riscv_rmii_refclk]

set_input_delay -clock [get_clocks riscv_jtag_tck] 60.000 [get_ports {riscv_jtag_tdi riscv_jtag_tms}]
set_output_delay -clock [get_clocks riscv_jtag_tck] 60.000 [get_ports riscv_jtag_tdo]
set_input_delay -clock [get_clocks sclk] 12.000 [get_ports miso_0]
set_output_delay -clock [get_clocks sclk] 10.000 [get_ports {mosi_0 nss_0 sclk_0}]
set_input_delay -clock [get_clocks riscv_rmii_refclk] 12.000 [get_ports {riscv_rmii_crs_dv {riscv_rmii_rxd[0]} {riscv_rmii_rxd[1]}}]
set_output_delay -clock [get_clocks riscv_rmii_refclk] 5.000 [get_ports {riscv_rmii_tx_en {riscv_rmii_txd[0]} {riscv_rmii_txd[1]}}]
set_input_delay -clock [get_clocks clk_fpga_0] 10.000 [get_ports riscv_uart_rxd]
set_output_delay -clock [get_clocks clk_fpga_0] 10.000 [get_ports riscv_uart_txd]

# tx async
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[0]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[1]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[2]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[3]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[4]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[5]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[6]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[7]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[8]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[9]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[10]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[11]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[12]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[13]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[14]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[15]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[16]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[17]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[18]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[19]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[20]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[21]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[22]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[23]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[24]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[25]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[26]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[27]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[28]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[29]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[30]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_mem_ap/tx_mem_rdata_reg[31]/D}] -100.000 -clock [get_clocks clk_fpga_0]

set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[0]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[1]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[2]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[3]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[4]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[5]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[6]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[7]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[8]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[9]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[10]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[11]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[12]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[13]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[14]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[15]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[16]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[17]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[18]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[19]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[20]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[21]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[22]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[23]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[24]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[25]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[26]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[27]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[28]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[29]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[30]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_rdata_reg[31]/D}] -100.000 -clock [get_clocks clk_fpga_0]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/rx_tog_s1_reg/D] -to [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_mem_ap/tx_mem_slverr_reg/D] -100.000 -clock [get_clocks clk_fpga_0]
#rx async
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[3]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[4]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[5]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[6]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[7]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[8]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[9]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[10]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_addr_reg[11]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_write_reg/D] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[0]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[1]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[3]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[4]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[5]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[6]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[7]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[8]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[9]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[10]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[11]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[12]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[13]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[14]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[15]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[16]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[17]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[18]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[19]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[20]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[21]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[22]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[23]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[24]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[25]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[26]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[27]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[28]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[29]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[30]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_apb_ap/u_apb_rx/rx_mem_wdata_reg[31]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]

set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[0]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[1]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[3]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[4]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[5]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[6]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[7]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[8]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[9]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[10]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[11]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[12]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[13]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[14]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[15]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[16]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[17]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[18]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[19]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[20]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[21]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[22]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[23]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[24]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[25]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[26]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[27]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[28]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[29]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[30]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_addr_reg[31]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_write_reg/D] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[0]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[1]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[3]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[4]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[5]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[6]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[7]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[8]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[9]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[10]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[11]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[12]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[13]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[14]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[15]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[16]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[17]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[18]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[19]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[20]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[21]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[22]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[23]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[24]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[25]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[26]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[27]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[28]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[29]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[30]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_wdata_reg[31]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_size_reg[0]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_size_reg[1]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_size_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_prot_reg[0]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_prot_reg[1]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins {soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_prot_reg[2]/D}] -22.000 -clock [get_clocks riscv_jtag_tck]
set_data_check -setup -from [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/tx_tog_s1_reg/D] -to [get_pins soc_i/cpu_wrap_0/inst/u_dap/u_axi_ap/u_axi_rx/rx_mem_secen_reg/D] -22.000 -clock [get_clocks riscv_jtag_tck]
